import React, { Component } from 'react';
import Tree123 from '../Components/Tree123';
class DBNav extends Component {
    render() {
        return (
            <>
            <div class="text-center">
                <div class="btn-group me-2 mt-5">
                    <button type="button" class="btn btn-outline-secondary">А</button>
                    <button type="button" class="btn btn-outline-secondary">Б</button>
                    <button type="button" class="btn btn-outline-secondary">В</button>
                    <button type="button" class="btn btn-outline-secondary">Г</button>
                    <button type="button" class="btn btn-outline-secondary">Д</button>
                    <button type="button" class="btn btn-outline-secondary">Е</button>
                    <button type="button" class="btn btn-outline-secondary">Ж</button>
                    <button type="button" class="btn btn-outline-secondary">З</button>
                    <button type="button" class="btn btn-outline-secondary">И</button>
                    <button type="button" class="btn btn-outline-secondary">К</button>
                    <button type="button" class="btn btn-outline-secondary">Л</button>
                    <button type="button" class="btn btn-outline-secondary">М</button>
                    <button type="button" class="btn btn-outline-secondary">Н</button>
                    <button type="button" class="btn btn-outline-secondary">О</button>
                    <button type="button" class="btn btn-outline-secondary">П</button>
                    <button type="button" class="btn btn-outline-secondary">Р</button>
                    <button type="button" class="btn btn-outline-secondary">С</button>
                    <button type="button" class="btn btn-outline-secondary">Т</button>
                    <button type="button" class="btn btn-outline-secondary">У</button>
                    <button type="button" class="btn btn-outline-secondary">Ф</button>
                    <button type="button" class="btn btn-outline-secondary">Х</button>
                    <button type="button" class="btn btn-outline-secondary">Ц</button>
                    <button type="button" class="btn btn-outline-secondary">Ч</button>
                    <button type="button" class="btn btn-outline-secondary">Ш</button>
                    <button type="button" class="btn btn-outline-secondary">Щ</button>
                    <button type="button" class="btn btn-outline-secondary">Э</button>
                    <button type="button" class="btn btn-outline-secondary">Ю</button>
                    <button type="button" class="btn btn-outline-secondary">Я</button>
                    <button type="button" class="btn btn-outline-secondary">Другое</button>
                </div>
            </div>
            <div class="row">
                <div class="col">
                    <label for="exampleFormControlTextarea1"></label>
                    <textarea class="form-control" id="exampleFormControlTextarea1" rows="15">снижается уровень сывороточного железа| ферритина| повышается общая железосвязывающая способность плазмы (в норме 30|6 - 84|6 мкмоль/л) и повышается латентная железосвязывающая способность (в норме 16 – 44 мкмоль/л) 
Железодефицитная анемия
Анемический (циркуляторно-гипоксический) синдром; 2)сидеропеническийсидеропенический синдром; 3)Кровь (таблица 7.1): эритроциты: меньше нормы. Микро-, пойкило-, анизо-, шизоциты. Нв ниже нормы, снижение количества ретикулоцитов. Гипохромия эритроцитов - цветовой показатель (MCH) - ниже нормы. Снижено содержание сывороточного железа, ферритина менее 30 мкг/л, процента насыщения трансферрина железом – менее 25%. 
В-12, фолиеводефицитные анемии
анемический (циркуляторно-гипоксический) синдром; 2)неврологический синдром – только при В-12 зависимой анемии (шаткость походки, мышечная слабость, пленевриты, полиневропатии, обусловленные развитием фуникулярного миелоза; 3)поражения желудочно-кишечного тракта – атрофические, воспалительные процессы, резекция желудка, тонкого кишечника, глоссит (сосочки стерты, поверхность гладкая, ярко-розовая – «лаковый», «малиновый» язык), гепатомегалия, спленомегалия. 4)Кровь (таблица 7.2): ## Эритроциты. Макроцитоз, мегалобласты, анизо- и пойкилоцитоз. ## Нв. ниже нормы, снижение количества ретикулоцитов. ## Гиперхромия эритроцитов - понижен цветовой показатель (MCH). ## Полисегментация ядер нейтрофилов. ## Тельца Жоли, кольца Кебота ( остатки ядра в эритроцитах). ## Непрямой билирубин более 34 мкмоль/л. ## Сыв.железо > нормы. Понижено содержание вит В-12 и фолиевой кислоты. 5)Костный мозг: мегалобластический тип кроветворения. 
Геморрагический синдром
синяки| кровоподтеки 
петехиальная сыпь на коже и слизистых оболочках 
кровохаркание 
кровотечение из носа| десен| желудка| кишечника| мочевых и половых путей и т.д. 
положительные пробы жгута| щипка| Кончаловского-Румпеля-Лееде и т.д. Клинические проявления геморрагических диатезов характеризуются пятью наиболее часто встречающимися типами кровоточивости (Баркаган З.С.| 1975|1980): 
Гематомный тип 
Петехиально-пятнистый (синячковый) тип (рис. 7.3) 
Смешанный (синячково-гематомный) тип 
Васкулитно-пурпурный тип (рис. 7.2) 
Ангиоматозный тип Воспалительный (инфекционно-воспалительный) синдром
Воспалительный (инфекционно-воспалительный) синдром
лихорадка 
ангины 
абсцессы 
глоссит| стоматит 
картина сепсиса 
любые очаги инфекции 
соответствующие изменения лабораторной воспалительной активности (СОЭ| СРБ| серомукоид и т. д.) 
Гиперпластический синдром
Безболезненное увеличение лимфатических узлов| печени и селезенки| миндалин (они значительно увеличиваются| становятся рыхлыми| могут затруднять дыхание). 
Возможно выраженное увеличение лимфатических узлов в средостении| что может привести к сдавлению верхней полой вены и нарушению оттока крови в правое предсердие (синдром верхней полой вены с основными клиническими проявлениями — одышкой, цианозом, отечностью шеи, набуханием шейных вен). 3)Характерны также гиперплазия десен и развитие тяжелого язвенно-некротического стоматита, при этом происходит язвенно-некротическое поражение миндалин, слизистой оболочки полости рта, распространяющееся на глотку, пищевод. 4)Оссалгия - болезненность при поколачивании костей за счет развития субпериостальных лейкемических инфильтратов. 5)На коже появляются лейкозные инфильтраты в виде лейкемидов — распространенных красновато-синеватых папулообразных бляшек. 6)Тяжелым проявлением гиперпластического синдрома являются также выраженная болезненная инфильтрация яичек и поражение нервной системы — нейролейкемия. 
Неврологический синдром
парестезии| атаксия| полиневрит 
энцефалопатия (инсульты| параличи| головные боли) 
извращения вкуса (геофагия)| обоняния (при железодефицитных анемиях) 
картина фуникулярного миелоза (при мегалобластных анемиях) 
Иммунодефицитный синдром
инфекционно-воспалителительные процессы| которые| как правило| принимают тяжелое течение| нередко развивается септическое состояние. Инфекционновоспалительные заболевания| в первую очередь тяжелые пневмонии| часто приводят к гибели больных. Однако следует учесть| что лихорадка может быть проявлением манифестации лейкоза| трансфузионной реакции| инфаркта селезенки| тромбофлебита| что требует дифференциальной диагностики с инфекционно-воспалительными заболеваниями. Лейкемический синдром (гемобластозы) Острый лейкемический синдром:
Лейкемический синдром (гемобластозы) Острый лейкемический синдром:
острое начало: часто в дебюте некротическая ангина| стоматит| лихорадка. 
анемический синдром, 3)геморрагический синдром, 4)иммунодефицитный и воспалительный (возможно развитие септических состояний) синдром, 5)интоксикационный синдром (слабость, потливость, лихорадка), 6)гиперпластический синдром, 7)оссалгии, артралгии, 8)лабораторные изменения. ОАК (рис. 7.4): цитопения (лейкопения, тромбоцитопения, анемия) или лейкоцитоз, характерен лейкемический провал (hiatus leucemicus) – отсутствие промежуточных форм между бластами и зрелыми клетками, т.е. нет промиелоцитов, миелоцитов, метамиелоцитов (юных) клеток. Ускорено СОЭ, повышены СРБ и ЛДГ. Миелограмма – преобладание бластных клеток. 
Хронический миелопролиферативный синдром
(для хронического миелолейкоза). 
медленное| постепенное развитие. 
анемический синдром, 3)геморрагический синдром, 4)иммунодефицитный и воспалительный синдром (возможно развитие септических состояний), 5)интоксикационный синдром (слабость, потливость, лихорадка), 6)оссалгии, артралгии, 7)гиперпластический синдром: ## спленомегалия (рис. 7.5) и, реже, увеличение печени; ## оссалгии, болезненность и чувствительность при поколачивании костей; ## относительно редкое увеличение лимфатических узлов. 8)лабораторные изменения. ОАК (рис. 7.6): лейкоцитоз, гиперлейкоцитоз, все переходные формы клеточных элементов: промиелоциты, миелоциты, метамиелоциты, палочкоядерные и сегментоядерные нейтрофилы. Нет «лейкемического провала». Анемия тромбоцитоз, в терминальной стадии тромбоцитопения. Эозинофильно-базофильная ассоциация. Ускорено СОЭ, повышены СРБ и ЛДГ. Миелограмма – единичные бластные клетки. В крови и костном мозге - филадельфийская хромосома. 
Хронический лимфопролиферативный синдром
медленное| постепенное развитие| чаще в возрасте после 40 лет. 
анемический синдром, 3)геморрагический синдром, 4)иммунодефицитный и воспалительный синдром (возможно развитие септических состояний), 5)интоксикационный синдром (слабость, потливость, лихорадка), 6)оссалгии, артралгии, 7)гиперпластический синдром: а) преимущественное увеличение лимфатических узлов (рис. 7.7) (безболезненных, тестовато-эластичной консистенции, не спаянных между собой, подвижных); б) отсутствие или умеренное увеличение селезенки и печени; в) частые поражения кожи, (кожные инфильтраты, экзема, псориаз, опоясывающий лишай и др.). 8)лабораторные изменения. ОАК (рис. 7.8): лейкоцитоз, гиперлейкоцитоз преимущественно за счет зрелых лимфоцитов, иногда единичных лимфобластов и пролимфобластов, тени Боткина-Гумпрехта, анемия, тромбоцитопения, подавление остальных ростков. Ускорено СОЭ, повышены СРБ и ЛДГ. Миелограмма – лимфоциты (до 90%) лимфобласты (до10%), тени Боткина–Гумпрехта (до 10-20%). Биопсия лимфоузлов. Синдром диссеминированного внутрисосудистого свертывания крови (ДВС-синдром)
Синдром диссеминированного внутрисосудистого свертывания крови (ДВС-синдром)
клинические проявления связаны с ишемическими (тромботическими) и геморрагическими повреждениями органов и тканей| имеющих хорошо развитую микроциркуляторную сеть (легкие| почки| надпочечники| желудочнокишечный тракт| печень| селезенка| кожа| слизистые оболочки) и характеризуются их дисфункцией и кровоточивостью различной степени. Одним из наиболее частых| хотя и необязательных проявлений этого синдрома является кровоточивость, которая отмечается в среднем у 55-T5% больных. Диагностика ДВС — синдрома: 1)Сосудисто-тромбоцитарный гемостаз. Проба щипка, жгута, манжеточная проба, количество тромбоцитов, определение тромбоцитарного фактора (ТФ4); 2)Коагуляционный гемостаз: ## время свертывания крови; ## активированное парциальное (частичное) тромбопластиновое время (АПТВ); ## определение протромбинового времени; ## определение тромбинового времени свертывания; ## определение концентрации фибриногена. 3)Физиологические антикоагулянты: 4)определение активности АТ Ш (антитромбина Ш). 5)Фибринолиз; 6)Методы, выявляющие маркеров внутрисосудистого свертывания крови и фибринолиза. Паракоагуляционные тесты: ## этаноловый тест; ## протаминсульфатный тест; ## определение РФМК (растворимых фибринмономерных комплексов); ## определение ПФД (продуктов деградации фибрина).
A01.1
Паратиф A
['Паратиф A']</textarea>
            <button type="button" class="btn btn-outline-secondary  mt-2">Очистить текстовое поле</button>
                </div>
                <div class="col">
                    <input type="text" class="form-control" placeholder="Last name" aria-label="Last name"/>
                </div>
            </div>
            
            <Tree123 goal_url="treesmkb" />
            
            <div class="col-sm-10">
                <input type="text" readonly class="form-control-plaintext" id="staticEmail" value=""/>
            </div>
            </>

        );
    }
}

export default DBNav;